///////////////////////////////////////////////////////////////////////////////
//
//  File:           IGPSDataSource.cs
//
//  Facility:       Хранение GPS сведений о мобильных клиентах.
//
//
//  Abstract:       Интерфейс для получения с сервера данных о мобильных 
//                  клиентах.
//
//  Environment:    VC 7.1
//
//  Author:         Зайцев С.А.
//
//  Creation Date:  11-11-2005
//
///////////////////////////////////////////////////////////////////////////////

using System;
using LightCom.MiP.Cache;
using LightCom.MiP.Common;

namespace LightCom.MiP.DataSource
{
/// 
/// <summary>
/// Интерфейс для получения с сервера данных о мобильных клиентах.
/// </summary>
/// 

public interface IGPSDataSource
{
////////////////////////////////////////////////////////////////////////////////
/// 
/// <summary>
/// Возвращает строчку с текстом последней ошибки.
/// </summary>
/// <returns>Возвращает строчку с текстом последней ошибки.</returns>
///
////////////////////////////////////////////////////////////////////////////////

string GetLastErrorText ();

////////////////////////////////////////////////////////////////////////////////
/// 
/// <summary>
/// Устанавливает соединение с сервером.
/// </summary>
/// <returns>true, если соединение установлено успешно.</returns>
/// 
////////////////////////////////////////////////////////////////////////////////

bool Connect ();

////////////////////////////////////////////////////////////////////////////////
/// 
/// <summary>
/// Разрывает соединение с сервером.
/// </summary>
/// <returns>true, если соединение разорвано успешно.</returns>
///
////////////////////////////////////////////////////////////////////////////////

bool Disconnect ();

////////////////////////////////////////////////////////////////////////////////
/// 
/// <summary>
/// Получение списка идентификаторов мобильных клиентов.
/// </summary>
/// <param name="strClientId">Массив идентификаторов мобильных клиентов.
/// </param>
/// <returns>true, если список был получен успешно.</returns>
///
////////////////////////////////////////////////////////////////////////////////

bool GetMobileClientList (out string [] strClientId);

////////////////////////////////////////////////////////////////////////////////
/// 
/// <summary>
/// Загрузка описаний заданных мобильных клиентов.
/// </summary>
/// <param name="strClientId">Массив идентификаторов мобильных клиентов.
/// </param>
/// <param name="clientsInfo">Массив описаний мобильных клиентов.</param>
/// <returns>true, если список был получен успешно.</returns>
///
////////////////////////////////////////////////////////////////////////////////

bool GetMobileClientsInfo (string [] strClientId, 
                            out MobileClientList clientsInfo);

////////////////////////////////////////////////////////////////////////////////
/// 
/// <summary>
/// Получение первого события для заданной группы мобильных клиентов.
/// </summary>
/// <param name="strClientId">Массив идентификаторов мобильных клиентов.
/// </param>
/// <param name="firstEvent">Время первого события.</param>
/// <returns>true, если операция была выполнена успешно.</returns>
/// 
////////////////////////////////////////////////////////////////////////////////

bool GetFirstEvent (string [] strClientId, 
                    out DateTime firstEvent);

////////////////////////////////////////////////////////////////////////////////
/// 
/// <summary>
/// Получение последнего события для заданной группы мобильных клиентов.
/// </summary>
/// <param name="strClientId">>Массив идентификаторов мобильных клиентов.
/// </param>
/// <param name="lastEvent">Время последнего события.</param>
/// <returns>true, если операция была выполнена успешно.</returns>
/// 
////////////////////////////////////////////////////////////////////////////////

bool GetLastEvent (string [] strClientId, out DateTime lastEvent);

////////////////////////////////////////////////////////////////////////////////
/// 
/// <summary>
/// Получение последнего события для заданной группы мобильных клиентов.
/// </summary>
/// <param name="strClientId">>Массив идентификаторов мобильных клиентов.
/// </param>
/// <param name="firstEvent">Время первого события.</param>
/// <param name="lastEvent">Время последнего события.</param>
/// <returns>true, если операция была выполнена успешно.</returns>
///
////////////////////////////////////////////////////////////////////////////////

bool GetEvents (string [] strClientId, 
                out DateTime firstEvent, 
                out DateTime lastEvent);

////////////////////////////////////////////////////////////////////////////////
/// 
/// <summary>
/// Загружает в кэш сведения о положении заданных клиентов за интервал
/// [from; to]
/// </summary>
/// <param name="cache">Кэш. В нем должен храниться список интересующих 
/// клиентов.</param>
/// <returns>true, если операция была выполнена успешно.</returns>
///
////////////////////////////////////////////////////////////////////////////////

bool ReadGPSData (GPSDataCache cache, 
                    DateTime from, 
                    DateTime to);

////////////////////////////////////////////////////////////////////////////////
/// 
/// <summary>
/// Загружает в кэш сведения о положении заданных клиентов за интервал
/// [now - historyDepth; now]
/// </summary>
/// <param name="cache">Кэш. В нем должен храниться список интересующих 
/// клиентов.</param>
/// <param name="historyDepth">Величина интервала "истории" перемещений.
/// </param>
/// <returns>true, если операция была выполнена успешно.</returns>
/// 
////////////////////////////////////////////////////////////////////////////////

bool ReadLatestGPSData (GPSDataCache cache, 
                        TimeSpan historyDepth);

////////////////////////////////////////////////////////////////////////////////
/// 
/// <summary>
/// Обновляет хранимые на сервере описания о мобильных клиентов.
/// </summary>
/// <param name="clientInfo">Новые описания мобильных клиентов.</param>
/// <returns>true, если операция была выполнена успешно.</returns>
/// 
////////////////////////////////////////////////////////////////////////////////

bool UpdateMobileClientInfo (MobileClientList clientInfo);
}
}
