////////////////////////////////////////////////////////////////////////////////
//                                                                            
//  File:           ISettings.cs
//
//  Facility:       Хранение настроек.
//
//
//  Abstract:       Модуль содержит определение интерфейса, который будут 
//                  реализовывать классы, которы необходимо хранить свои 
//                  настройки.
//
//  Environment:    VC# 7.1
//
//  Author:         Зайцев С. А.
//
//  Creation Date:  13/09/2005
//
////////////////////////////////////////////////////////////////////////////////

using System;

namespace GPS.Common
{
/// 
/// <summary>
/// Интерфейс сохранения настроек объекта.
/// </summary>
/// 

public interface ISettings 
{

//////////////////////////////////////////////////////////////////////////////// 
/// 
/// <summary>
/// Сбрасывает состояние объекта в начальное состояние.
/// </summary>
/// 
//////////////////////////////////////////////////////////////////////////////// 

void Reset ();

//////////////////////////////////////////////////////////////////////////////// 
/// 
/// <summary>
/// Сохраняет настройки объекта в заданном хранилище.
/// </summary>
/// <param name="storage">Интерфейс сохранения параметров.</param>
/// <returns>Возвращает true, если сохранение прошло успешно.
/// </returns>
/// 
//////////////////////////////////////////////////////////////////////////////// 

bool Save (ISettingsStorage storage);

//////////////////////////////////////////////////////////////////////////////// 
/// 
/// <summary>
/// Загружает настройки объекта из заданного хранилища.
/// </summary>
/// <param name="storage">Интерфейс сохранения параметров.</param>
/// <returns>Возвращает true, если загрузка прошла успешно.
/// </returns>
///
//////////////////////////////////////////////////////////////////////////////// 

bool Load (ISettingsStorage storage);
}
}


